CSI API ETABS v1

# cFunctionGetValues Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetValues(
    	string Name,
    	ref int NumberItems,
    	ref double[] MyTime,
    	ref double[] Value
    )

    Function GetValues (
    	Name As String,
    	ByRef NumberItems As Integer,
    	ByRef MyTime As Double(),
    	ByRef Value As Double()
    ) As Integer

    Dim instance As cFunction
    Dim Name As String
    Dim NumberItems As Integer
    Dim MyTime As Double()
    Dim Value As Double()
    Dim returnValue As Integer

    returnValue = instance.GetValues(Name,
    	NumberItems, MyTime, Value)

    int GetValues(
    	String^ Name,
    	int% NumberItems,
    	array<double>^% MyTime,
    	array<double>^% Value
    )

    abstract GetValues :
            Name : string *
            NumberItems : int byref *
            MyTime : float[] byref *
            Value : float[] byref -> int

#### Parameters

Name

    Type: SystemString

NumberItems

    Type: SystemInt32

MyTime

    Type: SystemDouble

Value

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cFunction Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com